rottenpotatoes/app/controllers/movies_controller.rb

  def similar
    @similar_movies = Movie.similar_director params[:title]
    if @similar_movies.nil?
      flash[:warning]="'#{params[:title]}' has no director info"
      #redirect_to movies_path, alert: "'#{params[:title]}' has no director info"
      redirect_to movies_path
    end
    @movie = Movie.find_by title: params[:title]
---
SELECT  "movies".* FROM "movies" WHERE "movies"."title" = ? LIMIT 1  [["title", "1"]]